### Pandas is usally used for Data Analysis

In [1]:
import pandas as pd
pd.__version__

'2.2.1'

In [5]:
a = [1, 2, 3.5]
my_data = pd.Series(a)
my_data
print(my_data)

0    1.0
1    2.0
2    3.5
dtype: float64

In [6]:
### Index argument to assign our desirable labels

In [7]:
my_data2 = pd.Series(a, index = [0.1, 0.2, 0.3], copy = True)
print(my_data2)

0.1    1.0
0.2    2.0
0.3    3.5
dtype: float64

### Key/Value Objects

In [8]:
#### A Pandas DataFrame is a 2 dimensional data structure

In [9]:
data = {
    'c' : ['a', 'b', 'c'],
    'd' : [1, 2, 3],
    'e' : ["Ali", "Moh", "Nag"],
}
data
x = pd.DataFrame(data)
print(x)

   c  d    e
0  a  1  Ali
1  b  2  Moh
2  c  3  Nag

In [10]:
x.loc[0] ## Specific Row to return

c      a
d      1
e    Ali
Name: 0, dtype: object

## Named Indexes

In [12]:
x = pd.DataFrame(data, index = ["Boy", "Widow","Girl"])
print(x)

       c  d    e
Boy    a  1  Ali
Widow  b  2  Moh
Girl   c  3  Nag

### One common and efficient way of storing huge datas is to use "df = pd.read_csv('data.csv')"

In [14]:
x.info() #print information about DataFrame

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Boy to Girl
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c       3 non-null      object
 1   d       3 non-null      int64
 2   e       3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [2]:
import seaborn as sns
df = sns.load_dataset("titanic")

<frozen importlib._bootstrap>:241: RuntimeWarning: scipy._lib.messagestream.MessageStream size changed, may indicate binary incompatibility. Expected 56 from C header, got 64 from PyObject

In [3]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### Cleaning Data

In [4]:
#By default, the dropna() method returns a new DataFrame, and will not change the original.
#Df.dropna() Removes all the Null values

In [5]:
#fillna(inplace = True) is used to replace Null values with any desirable value

## Cleaning Data of Wrong format